$(function(){
    var companys = [
    {
        "profession": ["五险一金","弹性工作","带薪旅游","年底双薪","交通补助"],
        "company": "京东金融",
        "slogan": "帮用户找到满意工作",
        "jobs":["高级产品经理","数据分析师","高级设计师","SEM","SEO","前端工程师"]
    },
    {
        "profession":["技能培训","弹性工作","节日礼物","带薪年假","午餐补助"],
        "company": "宜信",
        "slogan": "宜人宜己 信用中国",
        "jobs": ["ios开发工程师","产品经理","UI设计师","产品运营","BD经理","数据分析师"]
    },
    {
        "profession": ["十五薪", "餐补","五险一金"],
        "company": "人人贷",
        "slogan": "打造一个人人参与、人人自由、人人平等的互联网个人金融服务平台",
        "jobs": ["前端工程师","后台产品经理","视觉设计","自媒体运营","媒介主管","行政前台"]
    },
    {
        "profession": ["五险一金","工作弹性","技术导向","年度旅游"],
        "company": "爱钱进",
        "slogan": "团队是你想要的团队",
        "jobs": ["高级运维工程师","移动产品经理","移动推广经理","SEM经理","高级架构师","移动产品大神"]
    },
    {
        "profession": ["五险一金","带薪年假","工作居住证","年度旅游"],
        "company": "积木盒子",
        "slogan": "通过互联网技术让更广大的投资者安全、高效、轻松地理财。",
        "jobs": ["架构师","产品经理","高级交互设计师","客服专员","市场总监","财务经理"]
    },
    {
        "profession":[ "绩效奖金","岗位晋升","节日礼物","技能培训","弹性工作","五险一金"],
        "company": "投哪网",
        "slogan": "百年诚信，诚信中国！",
        "jobs":["软件测试工程师","产品总监","视觉设计师","网站运营总监","固定资产采购专员","人事行政专员"]
    },
    {
        "profession":[ "扁平管理","通讯津贴","管理规范","技能培训","弹性工作","五险一金"],
        "company": "广发证券",
        "slogan": "国内一线证券公司，正走在互联网化的路上",
        "jobs": ["数据开发工程师","web前端开发工程师","投资业务运营专员","大数据开发工程师","Android开发工程师","Java开发工程师"]
    },
    {
        "profession":[ "领导好","节日礼物","技能培训","弹性工作","五险一金"],
        "company": "支付宝",
        "slogan": "支付宝 知托付",
        "jobs":[ "Java","大数据开发工程师","商业产品经理","移动产品经理","BD经理","高级测试工程师"]
    },
    {
        "profession":[ "薪资高","弹性时间","旅游","免费水果","健身房"],
        "company": "拍拍贷",
        "slogan": "触手可及的金融",
        "jobs":[ "技术经理","产品总监","高级平面设计师","新媒体运营","SEO专员","人力资源专员/绩效专员"]
    },
    {
        "profession":[ "年终分红"," 绩效奖金"," 股票期权 ","年底双薪 "," 带薪年假","免费班车"],
        "company": "阿里旅行",
        "slogan": "让自由更自由",
        "jobs":[ "高级Java工程师","高级Java架构师","高级Java开发工程师","高级Java开发工程师","BD经理","运营专员"]
    },
    {
        "profession":["绩效奖金"," 股票期权 ","五险一金"," 带薪年假 ","免费班车 ","午餐补助"],
        "company": "途牛旅游网",
        "slogan": "要旅游，找途牛！",
        "jobs":["研发经理","高级产品经理","交互设计师","新媒体运营","营销策划","HRBP"]
    },
    {
        "profession":[ "技能培训",
            "旅游基金",
            "年终多薪",
            "季度晋升",
            "节日礼物",
            "五险一金"],
        "company": "去哪儿网",
        "slogan": "人生就是一段旅行，不在乎终点，在于沿途的风景。",
        "jobs":[ "ios开发工程师","移动产品经理","用户研究顾问","运营主管","BD经理","培训经理"]
    },
    {
        "profession":[ "员工免息贷款 ","优质福利保障 ","员工持股激励 ","最佳雇主 ","爱旅游"],
        "company": "艺龙网",
        "slogan": "中国最领先的在线旅行服务提供商",
        "jobs":["Android工程师","高级UI设计师","商家运营","员工关系专员","Java工程师","NOC工程师"]
    },
    {
        "profession":[ "绩效奖金"," 股票期权 ","五险一金"," 交通补助 ","带薪年假"," 年底双薪"],
        "company": "携程",
        "slogan": "携程在手 说走就走",
        "jobs":["Android","产品总监","视觉设计师","数据分析师","业务主管","部门培训文化主管"]
    },
    {
        "profession":[ "通讯津贴"," 交通补助"," 带薪年假 ","节日礼物 ","弹性工作 ","午餐补助"],
        "company": "驴妈妈旅游网",
        "slogan": "中国领先的新型B2C旅游电子商务网站",
        "jobs":["PHP","产品经理","网页交互设计师","UI设计师","数据分析","网页设计师"]
    },
    {
        "profession":[ "绩效奖金", "五险一金", "带薪年假", "节日礼物", "年度旅游", "定期体检"],
        "company": "芒果网",
        "slogan": "大中华区最受欢迎的互动式旅游电子商务平台",
        "jobs":["Node.js","HTML5","IT产品经理","无线交互设计师","产品运营经理","招聘专员"]
    },
    {
        "profession":[ "技能培训 ","节日礼物"," 股票期权 ","到处旅游 ","季度奖金"," 扁平管理"],
        "company": "一块去旅行网",
        "slogan": "领先的在线旅游服务商",
        "jobs":["互联网PHP软件工程师","产品助理","平面设计师","运营专员","商务渠道","市场策划"]
    },
    {
        "profession":[ "技能培训"," 免费班车"," 带薪年假"," 绩效奖金 ","岗位晋升"," 注重实力"],
        "company": "58同城",
        "slogan": "一个神奇的网站",
        "jobs":[ "前端研发","数据产品经理","UI设计师","区域运营经理","渠道专员","人力资源专员"]
    },
    {
        "profession":[ "领导好 ","五险一金"," 年底双薪"," 午餐补助"," 带薪年假"," 绩效奖金"],
        "company": "搜房网",
        "slogan": "全球最大的房地产和家居网上交易平台",
        "jobs":[ "Java工程师","移动产品经理","视觉设计师","运营经理","销售经理","行政"]
    },
    {
        "profession":["股票期权", "五险一金","通讯津贴", "交通补助", "带薪年假", "弹性工作"],
        "company": "小马管家",
        "slogan": "小马管家，重新定义家政服务",
        "jobs":[ "Web前端","产品运营","门店店长","销售总监","招聘经理","市场总监"]
    },
    {
        "profession":[ "岗位晋升"," 领导好 ","美女多 ","胖子多"," 吃货多 ","弹性工作"],
        "company": "大众点评",
        "slogan": "为网友提供餐饮、购物、休闲娱乐及生活服务等领域的互动平台",
        "jobs":[ "高级Java开发工程师","教育频道产品经理","营销视觉设计师","玩乐类目运营经理","销售代表","HRBP"]
    },
    {
        "profession":[ "五险一金"," 弹性工作"," 交通补助","绩效奖金 ","股票期权","带薪年假" ],
        "company": "考拉迷你仓",
        "slogan": "考拉迷你仓，不只是存东西的！",
        "jobs":[ "Java工程师","平面设计师","售后客服","销售经理","人事专员","UI设计师"]
    },
    {
        "profession":[ "技能培训"," 节日礼物 ","年底双薪 ","带薪年假"," 绩效奖金 ","岗位晋升"],
        "company": "实惠APP",
        "slogan": "实惠APP是一个全新的社区生活移动服务平台!",
        "jobs":[ "UI设计师","运营策略经理","品控专员","销售专员","市场策划","行政专员"]
    },
    {
        "profession":[ "年终分红","年底双薪","绩效奖金","专项奖金","五险一金","带薪年假"],
        "company": "珍爱网",
        "slogan": "珍爱网是国内最知名的婚恋服务网站之一,目前网站注册用户已达到6000万以上，拥有海量数据库。",
        "jobs":[ "前端开发工程师","项目经理","交互设计师","质检经理","商务经理","培训主管"]
    },
    {
        "profession":[ "节日礼物","技能培训","绩效奖金","年度旅游 ","岗位晋升","管理规范"],
        "company": "赶集网",
        "slogan": "盛情邀请痴迷于用互联网改造本地生活服务的同学，一起创造未来！",
        "jobs":[ "Android","商业产品经理","交互设计师","产品运营","BD经理","资深培训专员"]
    },
    {
        "profession":[ "节日礼物 绩效奖金 年度旅游 岗位晋升 管理规范 定期体检"],
        "company": "饿了么",
        "slogan": "激情 极致 创新",
        "jobs":[ "数据库架构师","数据产品经理","创意品牌设计师","产品运营专员","市场推广","行政助理"]
    },
    {
        "profession":[ "节日礼物", "年底双薪","最佳雇主", "扁平管理","免费午餐" ,"免费晚餐"],
        "company": "e袋洗",
        "slogan": "中国最好的居家服务平台",
        "jobs":[ "PHP","后台产品经理","平面设计师","运营主管","品牌策划经理","培训专员"]
    },
    {
        "profession":[ "弹性工作","节日礼物","岗位晋升","技能培训", "扁平管理","管理规范"],
        "company": "滴滴出行",
        "slogan": "滴滴一下，马上出发，移动互联网让出行更美好",
        "jobs":[ "Android开发","数据产品经理","视觉设计师","活动策划运营主管","城市经理","行政总监"]
    },
    {
        "profession":["年底双薪", "节日礼物", "绩效奖金", "岗位晋升", "管理规范", "通讯津贴"],
        "company": "百度外卖",
        "slogan": "百度外卖，制作有品质的外面",
        "jobs":[ "百度外卖BD经理","平面设计师","运营主管","品牌策划经理","培训专员","PHP"]
    },
    {
        "profession":[ "领导好 ","产品给力"," 团队靠谱 ","弹性工作","扁平管理"],
        "company": "呱呱洗车",
        "slogan": "卓越的互联网生活服务，高智商高情商的逗比团队，温馨舒畅的办公环境，欢迎你的加入！",
        "jobs":[ "HTML5开发工程师","移动产品经理","新媒体运营经理","高级采购助理","财务预算专员","高级Python开发"]
    },
    {
        "profession":["年底双薪", "带薪年假", "绩效奖金", "岗位晋升 ","扁平管理", "管理规范"],
        "company": "阿姨帮",
        "slogan": "阿姨帮，您的家庭好帮手",
        "jobs":[ "高级前端开发工程师","客户端产品经理","高级平面设计师","投诉主管","城市经理","阿姨总管"]
    },
    {
        "profession":[ "15~17薪","房租补贴","带薪年假","六险一金"],
        "company": "自如网",
        "slogan": "加入自如，让世界变得不一样~",
        "jobs":[ "web前端","移动产品经理","高级UI设计师","投诉处理专员","活动策划","业务助理"]
    },
    {
        "profession":[ "五险一金","节日礼物", "年终奖金", "年度旅游", "岗位晋升", "扁平管理"],
        "company": "爱鲜蜂",
        "slogan": "O2O电商行业50强企业",
        "jobs":[ "实施主管","产品经理","品牌视觉设计师","反作弊专员","战略分析经理","招聘专员"]
    },
    {
        "profession":[ "五险一金"," 带薪年假"," 免费班车"," 节日礼物"," 定期体检"," 午餐补助"],
        "company": "京东",
        "slogan": "让生活变得简单快乐",
        "jobs":[ "架构师","产品经理"," 用户体验总监","内容编辑","无线APP市场推广","人力资源总监 HRD"]
    },
    {
        "profession":[ "技能培训"," 节日礼物"," 绩效奖金"," 岗位晋升"," 年度旅游","  通讯津贴"],
        "company": "唯品会",
        "slogan": "市值超过新浪，网易，奇虎，成为腾讯，百度，阿里、京东之后的中国互联网第五大上市公司！",
        "jobs":[ "前端高级研发工程师","CRM高级产品经理","高级数据分析师","旅行产品资深运营师","校园推广","行政"]
    },
    {
        "profession":[ "岗位晋升 ","管理规范"," 帅哥多"," 五险一金"," 彩妆培训"," 股票期权"],
        "company": "聚美优品",
        "slogan": "聚集美丽，成人之美。",
        "jobs":[ "iOS研发工程师","自建配送高级产品经理","Flash设计师","运营经理","销售经理","会计主管"]
    },
    {
        "profession":[ "技能培训 ","节日礼物 ","年底双薪 ","年度旅游"," 通讯津贴"," 定期体检"],
        "company": "美丽说",
        "slogan": "中国最大的快时尚电商",
        "jobs":[ "数据平台后端开发工程师","交易高级产品经理","设计经理/主管 ","美丽微店新媒体运营专员","招商经理","账户安全专员"]
    },
    {
        "profession":[ "技能培训 ","免费班车 ","专项奖金"," 绩效奖金"," 岗位晋升 ","扁平管理"],
        "company": "酒仙网",
        "slogan": "中国互联网酒类第一名",
        "jobs":[ "CTO","产品经理","数据分析师","新媒体运营","销售主管","产品总监"]
    },
    {
        "profession":[ "周末双休","五险一金","免费班车","年终奖金"],
        "company": "美团网",
        "slogan": "技术大牛组成的牛人团队",
        "jobs":[ "技术经理","商户端产品经理","交互设计经理","产品运营","商务拓展专员","行政主管"]
    },
    {
        "profession":[ "节日礼物 ","带薪年假"," 绩效奖金"," 美女多"," 五险一金"," 午餐补助"],
        "company": "麦乐购",
        "slogan": "面向中国市场的正品进口，安全",
        "jobs":[ ".net开发工程师","市场设计师","运营专员","市场商务BD","运维工程师","移动端.net开发工程师"]
    },
    {
        "profession":[ "岗位晋升"," 年度旅游"," 管理规范"," 领导好"," 定期体检"," 五险一金"],
        "company": "1号店",
        "slogan": "第一家网上超市",
        "jobs":[ "PMO","搜索算法产品经理","交互设计Leader","生鲜运营主管","销售经理","招聘"]
    },
    {
        "profession":[ "岗位晋升"," 定期体检"," 年度旅游"," 五险一金"," 免费班车"," 美女多"],
        "company": "阿里巴巴",
        "slogan": "让天下没有难做的生意",
        "jobs":[ "java技术架构师","产品经理","资深视觉设计师","资深商品运营","大客户代表","技术保障-高级组织发展专家"]
    },
    {
        "profession":[ "股票期权 ","弹性工作 ","五险一金"," 免费班车 ","岗位晋升"," 节日礼物"],
        "company": "百度",
        "slogan": "众里寻他千百度",
        "jobs":[ "iOS - 高级研发工程师","产品经理","UI设计师","客服","市场营销","百度贴吧VP秘书"]
    },
    {
        "profession":[ "岗位晋升 ","转岗机会"," 管理规范"," 美女多"," 帅哥多"," 影响大"],
        "company": "腾讯",
        "slogan": "连接一切，从连接人才开始！",
        "jobs":[ "QQ后台开发工程师","高级产品运营经理","微信支付设计师","高级游戏运营策划","高级品牌公关经理","招聘经理"]
    },
    {
        "profession":[ "创业公司 ","扁平管理","成就感"," 五险一金"," 免费班车"],
        "company": "360",
        "slogan": "我们的核心价值观：用户至上、创业心态、持续创新、不断反思、 开放协作",
        "jobs":[ "C++","产品经理","资深UI设计师","电脑技术支持工程师","SEO推广专员","商务助理实习生"]
    },
    {
        "profession":[ "节日礼物 ","技能培训"," 免费班车"," 绩效奖金 ","岗位晋升"," 通讯津贴"],
        "company": "乐视",
        "slogan": "不断改变人们的互联网生活方式",
        "jobs":[ "音视频编解码工程师 C++","后台运营产品经理","后期包装","车联网服务运营总监","车联网销售VP","产品经理"]
    },
    {
        "profession":[ "技能培训 ","岗位晋升"," 管理规范"," 领导好 ","五险一金"," 弹性工作"],
        "company": "搜狐",
        "slogan": "中国最领先的新媒体、网络游戏、搜索及无线互联网服务公司",
        "jobs":[  "Flash开发工程师",
            "移动产品运营经理",
            "UI设计师",
            "内容运营编辑",
            "电商专员",
            "HRBP"]
    },
    {
        "profession":[ "五险一金 ","带薪年假"," 午餐补助 ","定期体检 ","弹性工作 ","免费班车"],
        "company": "搜狗",
        "slogan": "搜索技术为核心，致力于中文互联网信息的深度挖掘，帮助中国上亿网民加快信息获取速度，为用户创造价值",
        "jobs":[ "搜索事业部-C++开发工程师（网页搜索）-北京-00018","产品经理","搜狗手机浏览器高级产品经理","搜索事业部-页面分析研究员-北京","营销事业部-UI设计师-北京-00812","产品内容运营经理"]
    },
    {
        "profession":[ "技能培训 ","节日礼物 ","年底双薪 ","带薪年假 ","绩效奖金 ","岗位晋升"],
        "company": "今日头条",
        "slogan": "我们不刷存在感，我们只追求卓越",
        "jobs":[ "文本分析与挖掘（高级）工程师","国际化产品经理","UI设计师","财经频道运营经理","市场专员","招聘经理"]
    },
    {
        "profession":[ "技能培训 ","节日礼物 ","免费班车","全员Mac ","年度旅游 ","岗位晋升"],
        "company": "蘑菇街",
        "slogan": "国内最大的女性时尚消费零售平台",
        "jobs":[ "前端开发工程师","日文时尚编辑","PHP研发工程师","高级UI设计师","架构师","社区运营"]
    },
    {
        "profession":[ "节日礼物 ","年底双薪 ","专项奖金 ","带薪年假 ","绩效奖金 ","年度旅游"],
        "company": "网易",
        "slogan": "有态度的公司",
        "jobs":[ "web前端","高级Android工程师","高级iOS工程师","资深测试工程师","高级java工程师","财经要闻编辑"]
    },
    {
        "profession":[ "五险一金 ","午餐补助 ","扁平管理 ","领导好","管理规范 "],
        "company": "嘀嗒拼车",
        "slogan": "中国最大C2C拼车平台",
        "jobs":[ "平面设计","页面开发工程师","客服经理","H5开发工程师","视觉设计师"]
    },
    {
        "profession":[ "节日礼物 ","免费班车","技能培训","通讯津贴","绩效奖金 ","岗位晋升"],
        "company": "乐视网",
        "slogan": "不断改变人们的互联网生活方式",
        "jobs":[ "web前端","PHP","Python研发工程师","java开发工程师","windows客户端开发"]
    },
    {
        "profession":[ "节日礼物 ","年底双薪 ","专项奖金 ","带薪年假 ","绩效奖金 ","年度旅游"],
        "company": "快云科技",
        "slogan": "对于人才，我们绝不吝啬",
        "jobs":[ "web前端","PHP","Python研发工程师","java开发工程师","windows客户端开发"]
    },
    {
        "profession":[ "节日礼物 ","岗位晋升 ","通讯津贴 ","带薪年假 ","绩效奖金 ","管理规范"],
        "company": "翼支付",
        "slogan": "翼支付duang~靠谱",
        "jobs":[ "上海--产品经理","北京--法律合规","上海--营销策划","IT解决方案经理","O2O行业拓展经理"]
    }
];
    
    var mySwiper = new Swiper('.swiper-container',{
    autoplay : 5000,//可选选项，自动滑动5
    speed:2000,
    noSwiping : true,
    loop : true//可选选项，开启循环
    
    });
    $(".swiper-slide").mouseenter(function(event) {
        mySwiper.stopAutoplay();
    });
    $(".swiper-slide").mouseleave(function(event) {
        mySwiper.startAutoplay();
    });
    //点击公司logo，出现公司卡片
    $(".swiper-wrapper img").click(function(event){
        event.stopPropagation();
         $(".swiper-slide").unbind('mouseleave');
         
         var company = $(this).attr("alt");
         for(var i=0;i<companys.length;i++){
            if(company == companys[i].company){
                $(".comp_box").html(mytemplate("company-template",companys[i]));
                break;
            }
         }
        
        $(".comp_box").show();
    });

    //关闭卡片
    $(".comp_box").on("click",".close",function(event){
        $(".shade").hide();
        $(".yipai-shade").show();
        $(this).closest("div").hide();
        mySwiper.startAutoplay();
        $(".swiper-slide").mouseleave(function(event) {
            mySwiper.startAutoplay();
        });
    });

    function mytemplate(id,data){
        var source   = $("#"+id).html();
        var template = Handlebars.compile(source);
        return template(data);
    }
       
});